## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.bastion.azurerm_bastion_host.bastionhost will be created
  + resource "azurerm_bastion_host" "bastionhost" {
      + copy_paste_enabled        = true
      + dns_name                  = (known after apply)
      + file_copy_enabled         = false
      + id                        = (known after apply)
      + ip_connect_enabled        = false
      + kerberos_enabled          = false
      + location                  = "northeurope"
      + name                      = "aztf-hub-vnet-bastion"
      + resource_group_name       = "aztf-hub-rg"
      + scale_units               = 2
      + session_recording_enabled = false
      + shareable_link_enabled    = false
      + sku                       = "Basic"
      + tunneling_enabled         = false

      + ip_configuration {
          + name                 = "configuration"
          + public_ip_address_id = (known after apply)
          + subnet_id            = "/subscriptions/1c7e8402-ac8b-48d9-a8c8-f3de95064482/resourceGroups/aztf-hub-rg/providers/Microsoft.Network/virtualNetworks/aztf-hub-vnet/subnets/AzureBastionSubnet"
        }

      + timeouts {
          + create = "60m"
          + delete = "60m"
          + update = "60m"
        }
    }

  # module.bastion.azurerm_public_ip.bastionhost will be created
  + resource "azurerm_public_ip" "bastionhost" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "northeurope"
      + name                    = "aztf-hub-vnet-bastion-pip"
      + resource_group_name     = "aztf-hub-rg"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
    }

  # module.firewall.azurerm_firewall.firewall will be created
  + resource "azurerm_firewall" "firewall" {
      + dns_proxy_enabled   = (known after apply)
      + firewall_policy_id  = (known after apply)
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "aztf-hub-vnet-firewall"
      + resource_group_name = "aztf-hub-rg"
      + sku_name            = "AZFW_VNet"
      + sku_tier            = "Standard"
      + threat_intel_mode   = "Deny"

      + ip_configuration {
          + name                 = "configuration"
          + private_ip_address   = (known after apply)
          + public_ip_address_id = (known after apply)
          + subnet_id            = "/subscriptions/1c7e8402-ac8b-48d9-a8c8-f3de95064482/resourceGroups/aztf-hub-rg/providers/Microsoft.Network/virtualNetworks/aztf-hub-vnet/subnets/AzureFirewallSubnet"
        }

      + timeouts {
          + create = "60m"
          + delete = "60m"
          + update = "60m"
        }
    }

  # module.firewall.azurerm_public_ip.firewall will be created
  + resource "azurerm_public_ip" "firewall" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "northeurope"
      + name                    = "aztf-hub-vnet-firewall-pip"
      + resource_group_name     = "aztf-hub-rg"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
    }

  # module.firewall_rules.azurerm_firewall_policy.aks will be created
  + resource "azurerm_firewall_policy" "aks" {
      + child_policies           = (known after apply)
      + firewalls                = (known after apply)
      + id                       = (known after apply)
      + location                 = "northeurope"
      + name                     = "aks-fwp"
      + resource_group_name      = "aztf-hub-rg"
      + rule_collection_groups   = (known after apply)
      + sku                      = "Standard"
      + threat_intelligence_mode = "Alert"

      + intrusion_detection {
          + mode = "Deny"
        }
    }

  # module.firewall_rules.azurerm_firewall_policy_rule_collection_group.AKS will be created
  + resource "azurerm_firewall_policy_rule_collection_group" "AKS" {
      + firewall_policy_id = (known after apply)
      + id                 = (known after apply)
      + name               = "aks-rcg"
      + priority           = 200

      + application_rule_collection {
          + action   = "Allow"
          + name     = "aks_app_rules"
          + priority = 205

          + rule {
              + destination_fqdn_tags = [
                  + "AzureKubnernetesService",
                ]
              + name                  = "aks_service"
              + source_addresses      = [
                  + "10.1.0.0/16",
                ]

              + protocols {
                  + port = 443
                  + type = "Https"
                }
            }
        }

      + network_rule_collection {
          + action   = "Allow"
          + name     = "aks_network_rules"
          + priority = 201

          + rule {
              + destination_addresses = [
                  + "*",
                ]
              + destination_ports     = [
                  + "443",
                ]
              + name                  = "https"
              + protocols             = [
                  + "TCP",
                ]
              + source_addresses      = [
                  + "10.1.0.0/16",
                ]
            }
          + rule {
              + destination_addresses = [
                  + "*",
                ]
              + destination_ports     = [
                  + "53",
                ]
              + name                  = "dns"
              + protocols             = [
                  + "UDP",
                ]
              + source_addresses      = [
                  + "10.1.0.0/16",
                ]
            }
          + rule {
              + destination_addresses = [
                  + "*",
                ]
              + destination_ports     = [
                  + "123",
                ]
              + name                  = "time"
              + protocols             = [
                  + "UDP",
                ]
              + source_addresses      = [
                  + "10.1.0.0/16",
                ]
            }
          + rule {
              + destination_addresses = [
                  + "*",
                ]
              + destination_ports     = [
                  + "1194",
                ]
              + name                  = "tunnel_udp"
              + protocols             = [
                  + "UDP",
                ]
              + source_addresses      = [
                  + "10.1.0.0/16",
                ]
            }
          + rule {
              + destination_addresses = [
                  + "*",
                ]
              + destination_ports     = [
                  + "9000",
                ]
              + name                  = "tunnel_tcp"
              + protocols             = [
                  + "TCP",
                ]
              + source_addresses      = [
                  + "10.1.0.0/16",
                ]
            }
        }
    }

  # module.hub_networking.azurerm_network_security_group.nsgs["AzureBastionSubnet"] will be destroyed
  # (because key ["AzureBastionSubnet"] is not in for_each map)
  - resource "azurerm_network_security_group" "nsgs" {
      - id                  = "/subscriptions/1c7e8402-ac8b-48d9-a8c8-f3de95064482/resourceGroups/aztf-hub-rg/providers/Microsoft.Network/networkSecurityGroups/AzureBastionSubnet-nsg" -> null
      - location            = "northeurope" -> null
      - name                = "AzureBastionSubnet-nsg" -> null
      - resource_group_name = "aztf-hub-rg" -> null
      - security_rule       = [] -> null
      - tags                = {
          - "Environment" = "Dev"
          - "Git"         = "Github"
          - "Owner"       = "kmiszel"
          - "Purpose"     = "Hub"
          - "Source"      = "Terraform"
        } -> null
    }

  # module.hub_networking.azurerm_network_security_group.nsgs["AzureFirewallSubnet"] will be destroyed
  # (because key ["AzureFirewallSubnet"] is not in for_each map)
  - resource "azurerm_network_security_group" "nsgs" {
      - id                  = "/subscriptions/1c7e8402-ac8b-48d9-a8c8-f3de95064482/resourceGroups/aztf-hub-rg/providers/Microsoft.Network/networkSecurityGroups/AzureFirewallSubnet-nsg" -> null
      - location            = "northeurope" -> null
      - name                = "AzureFirewallSubnet-nsg" -> null
      - resource_group_name = "aztf-hub-rg" -> null
      - security_rule       = [] -> null
      - tags                = {
          - "Environment" = "Dev"
          - "Git"         = "Github"
          - "Owner"       = "kmiszel"
          - "Purpose"     = "Hub"
          - "Source"      = "Terraform"
        } -> null
    }

  # module.hub_networking.azurerm_network_security_group.nsgs["GatewaySubnet"] will be destroyed
  # (because key ["GatewaySubnet"] is not in for_each map)
  - resource "azurerm_network_security_group" "nsgs" {
      - id                  = "/subscriptions/1c7e8402-ac8b-48d9-a8c8-f3de95064482/resourceGroups/aztf-hub-rg/providers/Microsoft.Network/networkSecurityGroups/GatewaySubnet-nsg" -> null
      - location            = "northeurope" -> null
      - name                = "GatewaySubnet-nsg" -> null
      - resource_group_name = "aztf-hub-rg" -> null
      - security_rule       = [] -> null
      - tags                = {
          - "Environment" = "Dev"
          - "Git"         = "Github"
          - "Owner"       = "kmiszel"
          - "Purpose"     = "Hub"
          - "Source"      = "Terraform"
        } -> null
    }

Plan: 6 to add, 0 to change, 3 to destroy.
```
</details>